CREATE TABLE [Страны] (
    [Страна] NVARCHAR(50) PRIMARY KEY,
    [Столица] NVARCHAR(50),
    [Часть_света] NVARCHAR(50),
    [Население_тыс_чел] INT,
    [Площадь_тыс_км2] FLOAT,
    [Тип_управления] INT
);

CREATE TABLE [Управление] (
    [ID] INT PRIMARY KEY,
    [Вид] NVARCHAR(50)
);

INSERT INTO [Страны] ([Страна], [Столица], [Часть_света], [Население_тыс_чел], [Площадь_тыс_км2], [Тип_управления]) VALUES
(N'Австрия', N'Вена', N'Европа', 7513, 84, 4),
(N'Великобритания', N'Лондон', N'Европа', 55928, 244, 1),
(N'Греция', N'Афины', N'Европа', 9280, 132, 4),
(N'Афганистан', N'Кабул', N'Азия', 20340, 647, 3),
(N'Монголия', N'Улан-Батор', N'Азия', 1555, 1565, 4),
(N'Япония', N'Токио', N'Азия', 114276, 372, 1),
(N'Франция', N'Париж', N'Европа', 53183, 551, 3),
(N'Швеция', N'Стокгольм', N'Европа', 8268, 450, 1),
(N'Египет', N'Каир', N'Африка', 38740, 1001, 3),
(N'Сомали', N'Могадишо', N'Африка', 3350, 638, 3),
(N'США', N'Вашингтон', N'Америка', 217700, 9363, 3),
(N'Мексика', N'Мехико', N'Америка', 62500, 1973, 4),
(N'Мальта', N'Валлетта', N'Европа', 330, 0.3, 2),
(N'Монако', N'Монако', N'Европа', 25, 0.2, 1);

INSERT INTO [Управление] ([ID], [Вид]) VALUES
(1, N'Конституционная монархия'),
(2, N'Абсолютная монархия'),
(3, N'Президентская республика'),
(4, N'Парламентская республика'),
(5, N'Военная хунта');
