SELECT 'Пример 1'
SELECT Название, Столица, Площадь, Население, Континент, ROUND(CAST(Население AS FLOAT) * 100 / (SELECT SUM(Население) FROM Страны), 3) AS Процент FROM Страны ORDER BY Процент DESC;
SELECT 'Пример 2'
SELECT Название, Столица, Площадь, Население, Континент FROM Страны WHERE Население >(SELECT AVG(Население) FROM Страны)
SELECT 'Пример 3'
SELECT 
    Название, 
    Столица, 
    Площадь, 
    Население, 
    Континент
FROM (
    SELECT 
        Название, 
        Столица, 
        Площадь, 
        Население, 
        Континент
    FROM Страны
    WHERE Континент = 'Африка'
) AS Африка
WHERE Население > 50000000;

SELECT 'Пример 4'
SELECT 
    A.Название,
    A.Столица,
    A.Площадь,
    A.Население,
    A.Континент,
    ROUND( A.Население * 100.0 / (
             SELECT SUM(B.Население)
             FROM Страны B
             WHERE B.Континент = A.Континент
          ), 3) AS Процент
FROM Страны A
ORDER BY Процент DESC;

SELECT 'Пример 5'
SELECT 
    A.Название,
    A.Столица,
    A.Площадь,
    A.Население,
    A.Континент
FROM Страны A
WHERE A.Население > (
    SELECT AVG(B.Население)
    FROM Страны B
    WHERE B.Континент = A.Континент
);

SELECT 'Пример 6'
SELECT *
FROM Страны
WHERE Континент IN (
    SELECT Континент
    FROM Страны
    GROUP BY Континент
    HAVING AVG(Население) > (SELECT AVG(Население) FROM Страны)
);

SELECT 'Пример 7'
SELECT 
    Название, 
    Столица, 
    Площадь, 
    Население, 
    Континент
FROM Страны
WHERE Континент = 'Азия'
  AND Население > ALL (
      SELECT Население
      FROM Страны
      WHERE Континент = 'Европа'
  );

SELECT 'Пример 8'
SELECT 
    Название, 
    Столица, 
    Площадь, 
    Население, 
    Континент
FROM Страны
WHERE Континент = 'Европа'
  AND Население > ANY (
      SELECT Население
      FROM Страны
      WHERE Континент = 'Южная Америка'
  );

SELECT 'Пример 9'
SELECT 
    Название, 
    Столица, 
    Площадь, 
    Население, 
    Континент
FROM Страны
WHERE Континент = 'Африка'
  AND EXISTS (
      SELECT 1
      FROM Страны
      WHERE Континент = 'Африка'
        AND Население > 100000000
  );

SELECT 'Пример 10'
SELECT 
    Название, 
    Столица, 
    Площадь, 
    Население, 
    Континент
FROM Страны
WHERE Континент = (
    SELECT Континент
    FROM Страны
    WHERE Название = 'Науру'
);

SELECT 'Пример 11'
SELECT 
    Название, 
    Столица, 
    Площадь, 
    Население, 
    Континент
FROM Страны
WHERE Население <= (
    SELECT Население
    FROM Страны
    WHERE Название = 'Гондурас'
);

SELECT 'Пример 12'
SELECT 
    Название, 
    Столица, 
    Площадь, 
    Население, 
    Континент
FROM Страны
WHERE Население = (
    SELECT MAX(МинНаселение)
    FROM (
         SELECT MIN(Население) AS МинНаселение
         FROM Страны
         GROUP BY Континент
    ) AS T
);